models/deepseek-v2-lite/benchmark_results/p50_sweep_20260313_070758/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7025a9b14c20>, seed=42, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260313_070758', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-3852952f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-13 07:08:18 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [02:20<00:00,  1.40s/it]
Failed requests during benchmark run detected (capping to 10):
Error 0: Bad Gateway
Error 1: Bad Gateway
Error 2: Bad Gateway
Error 3: Bad Gateway
Error 4: Bad Gateway
Error 5: Bad Gateway
Error 6: Bad Gateway
Error 7: Bad Gateway
Error 8: Bad Gateway
Error 9: Bad Gateway
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     71        
Failed requests:                         29        
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  140.01    
Total input tokens:                      984699    
Total generated tokens:                  17892     
Request throughput (req/s):              0.51      
Output token throughput (tok/s):         127.79    
Peak output token throughput (tok/s):    364.00    
Peak concurrent requests:                70.00     
Total token throughput (tok/s):          7160.93   
---------------Time to First Token----------------
Mean TTFT (ms):                          24806.63  
Median TTFT (ms):                        25084.82  
P50 TTFT (ms):                           25084.82  
P90 TTFT (ms):                           42971.24  
P95 TTFT (ms):                           45794.03  
P99 TTFT (ms):                           46922.28  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.31     
Median TPOT (ms):                        44.41     
P50 TPOT (ms):                           44.41     
P90 TPOT (ms):                           46.05     
P95 TPOT (ms):                           46.18     
P99 TPOT (ms):                           46.62     
---------------Inter-token Latency----------------
Mean ITL (ms):                           44.31     
Median ITL (ms):                         37.79     
P50 ITL (ms):                            37.79     
P90 ITL (ms):                            50.72     
P95 ITL (ms):                            87.85     
P99 ITL (ms):                            151.30    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          35929.56  
Median E2EL (ms):                        36186.60  
P50 E2EL (ms):                           36186.60  
P90 E2EL (ms):                           53978.46  
P95 E2EL (ms):                           56055.69  
P99 E2EL (ms):                           56761.14  
==================================================